var instructions_texts = {
	welcome_page : 
		"<h2 class= 'instruction' style = 'font-size: xx-large' dir='rtl' > <b>بیایید یاد بگیریم که چطوری بازی کنیم.</b>  &#127891; </h2><p dir='rtl' > برای ادامه گزینه‌ی 'NEXT' را انتخاب کنید.	</p>",
  
	second_page : 
		"<div class= 'instruction' dir='rtl'> <p>این بازی شامل تعدادی مرحله است که در هر مرحله شما باید تصمیم بگیرید که در واکنش به مشاهده  یک نشانه خاص، عملی را انجام دهید یا از انجام دادن آن صرف نظر کنید: "+
    " در واقع قرار است با فشردن یک کلید مشخص کنید که در کدام سمت صفحه نمایش یک دایره‌ی مشکی دیدید. </p>" + 
    "<p>همانطور که گفتیم، قبل از اینکه دایره در صفحه نمایش نشان داده شود شما یک نشانه خواهید دید که در واقع یک تصویر فرکتال است و برای شما مشخص می‌کند که:	</p>"+
    "<ol> <li> کلیدی را فشار دهید یا ندهید.	</li> <li>نتیجه‌ی واکنش شما ممکن است منجر به پاداش شود یا ضرر. </li></ol>  </div>" 
	// + "<img src='../img/page1.png' width='70%' height='70%'>"
	,
                 
	sixth_page : 
		"<div class= 'instruction' dir='rtl'> <p>در این بازی ۴ تصویر متفاوت وجود دارد. در شروع هر مرحله، یکی از آن‌ها به صورت تصادفی نشان داده می‌شود.</p> "+
		" <p>با توجه به این‌که کدام تصویر را دیده باشید، شما باید با آزمون و خطا پیدا کنید که بهترین استراتژی که می‌توانید پیش بگیرید چیست. در واقع وقتی دایره مشکی را دیدید، با توجه به تصاویر، پیدا کنید که کدام کلید را انتخاب کنید یا اصلا واکنشی نشان ندهید.		</p>"+
		"<p> وقتی یاد می‌گیرید که برای هر تصویر کدام تصمیم بهتر است، که شانس برنده شدن خودتان را زیاد و شانس باختن خودتان را کم می‌کنید.</p> </div>" + 
  	"<img src='../img/page2.png' width='70%' height='70%'>",
  
	seventh_page : 
		"<div class= 'instruction' dir='rtl'><p>تعدادی از تصاویر پیش بینی می کنند که مقداری پول برنده می‌شوید یا چیزی به دست نمی‌آورید.<br>تعدادی دیگر از تصاویر  پیش بینی می کنند که مقداری پول از دست خواهید داد یا چیزی از دست نمی دهید.		</p>"+
		"<p> برنده شدن یا از دست دادن پول به صورت احتمالی است، یعنی ممکن است با تصمیم درست چیزی به دست نیاورید در صورتی که انتظار داشتید که پولی برنده خواهید شد. <br>  اما با تعیین بهترین استراتژی برای هر تصویر، می توانید احتمال دریافت نتیجه بهتر را بهینه کنید. به عنوان مثال، چیزی از دست ندادن بهتر از از دست دادن مقداری پول است.		</p>"+
		"<p>برای برخی از تصاویر، بهترین استراتژی فشار دادن دکمه است. برای برخی از تصاویر دیگر، بهترین استراتژی این است که از پاسخ دادن خودداری کنید.</p></div>",
  
	ninth_page : 
		"<p class= 'instruction' dir='rtl'> <b>معنای هر تصویر در طول بازی ثابت خواهد بود. <br> <br> با این حال، بازی آسان نیست. بنابراین ما شما را به سعی‌ و خطا و پیدا کردن بهترین استراتژی تشویق می‌کنیم.</b> </p>",
		ninth_p_page : 
	"<div class= 'instruction' style= 'text-align: center'><p dir='rtl'><b>لطفاً توجه داشته باشید که هیچ ارتباطی بین چپ یا راست آمدن دایره‌ها و تصاویر وجود ندارد.</b></p> ",
  
	third_page : 
	"<div class= 'instruction' dir='rtl'> <p>حالا بیایید کمی دقیق‌تر شویم.</p> "+
	" <p>در شروع هر مرحله یک تصویر فرکتال خواهید دید. در این لحظه نباید هیچ کلیدی را فشار دهید. </p>"+
	"<p> در واقع این‌جا <b>تصمیم می‌گیرید </b> <u> که در مرحله‌ی بعد کلید را فشار دهید یا از واکنش نشان دادن صرف نظر کنید</u>. </p> </div>" +
    " <p dir='rtl'> این‌ یک نمونه از تصویری است که ممکن است ببینید</p> <img src='../img/stim/f3_1.png' width='30%' height='30%'>",
  
	forth_page : 
		"<div class= 'instruction' dir='rtl'> <p> بعد از مکثی کوتاه، یک دایره‌ی مشکی خواهید دید که به صورت تصادفی سمت راست یا چپ یک مستطیل قرمز نمایش داده می‌شود. </p> "+
    "<p>با توجه به این‌که در مرحله قبل چه تصویری دیده باشید، این‌جا تصمیمتان را اجرا خواهید کرد.</p> <p>به عبارت دیگر، برای مشخص کردن سمت دایره <u> کلید چپ یا راست را فشار می‌دهید یا از جواب دادن خودداری کنید. </u></p>" +
	"<p> برای انتخاب سمت چپ کلید F  و برای انتخاب سمت راست از کلید J باید استفاده کند. </p>" +
	// "<p>شرکت کننده‌ی شماره ۲ برای انتخاب سمت چپ کلید D  و برای انتخاب سمت راست از کلید K باید استفاده کند. </p>" +
	"<p>اگر تصمیم شما بر فشار دادن کلید است، ۱ ثانیه زمان دارید تا تصمیم خود را عملی کنید. اگر معطل کنید، تصور بر این است که شما از پاسخ دادن خودداری کرده اید.	</p></div>" +

    "<img src = '../img/eighth_3_page.png' width='30%' height='30%'>",
  
	fifth_page : 
	"<p class= 'instruction' dir='rtl'>  بعد از مکثی کوتاه، یکی از سه نتیجه‌ی زیر را خواهید دید. </p>" +
		
	"<table style='margin-left:auto;margin-right:auto;table-layout:fixed !important; width:650px;border-spacing:3em;'><tr>" +
	"<td style='font-size:40px;'>&#9989;&#128176;&#9989;</td> "+"<td> نتیجه = بردن </td>" +
	"</tr><tr>" +
	"<td style='font-size:40px;'>&#10060;&#128184;&#10060;</td>"+"<td> نتیجه = باختن </td>" +
	"</tr><tr>" +
	"<td style='font-size:60px;'>&#x2796;</td>"+"<td> نتیجه = ته برد نه باخت</td>" +
	"</tr></table>",
	tenth_page :  
		"<div class= 'instruction' dir='rtl'> <p> <b>به یاد داشته باشید که در این بازی، نتیجه احتمالی است. </b></p> "+ 
    "<p> <b> یعنی گاهی حتی اگر بهترین استراتژی را بدانید، ممکن است باز هم برنده نشوید، یا بازنده شوید.	</b> </p>" +
    "<p>  با این حال، به یاد داشته باشید که برای هر تصویر یک استراتژی بهتر (یا فشار دادن یک کلید یا خودداری از پاسخ) وجود دارد که از دیگری بهتر است. <p></div>",
  
	eighth_page : 
		"<div class= 'instruction' dir='rtl'> <p>بنابراین برای نتیجه‌های مربوط به بردن ممکن است نمادهای &#9989;&#128176;&#9989; یا  &#x2796; را دریافت کنید.</p> "+
    "<p> برای  نتیجه‌های مربوط به باختن ممکن است نمادهای &#10060;&#128184;&#10060; یا  &#x2796; را دریافت کنید. </p>"+
    "<p> با انجام کار درست در هنگام ظاهر شدن دایره (یا کلید را فشار دادن یا از پاسخ دادن خودداری کردن) می توانید مطلوب‌ترین نتیجه را به دفعات به‌دست بیاورید .</p></div>" + 

    "<table style='margin-left:auto;margin-right:auto;table-layout:fixed !important; width:650px;border-spacing:3em;' dir='rtl'><tr>" +
    "<td> نتیجه مربوط به بردن</td> <td style='font-size:30px;'> &#9989;&#128176;&#9989; یا &#x2796;</td>" +
    "</tr><tr>" +
    "<td s>نتیجه مربوط به باختن</td> <td style='font-size:30px;'> &#x2796; یا &#10060;&#128184;&#10060; </td>" +
    "</tr></table>",
  
	eleventh_page : 
		"<div class= 'instruction' dir='rtl'> <p>قبل از شروع بازی اصلی، برای تمرین و آشنا شدن با شرایط، ۱۲ مرحله را به صورت تمرینی انجام خواهید داد. </p>"+
    "<p>پس از آن به بازی اصلی که به ۳ قسمت تقسیم شده، شروع می‌شود. می توانید بین هر قسمت ۱ دقیقه استراحت کنید. </p>"+
    "<p> مجموع امتیازهای شما شمرده می شود و در پایان آزمایش برای بازی گروهی که انجام دادید حداقل ۴۰۰ هزار تومان دستمزد دریافت خواهید کرد. </p> </div>",


	twelve_page: 
	"<div class= 'instruction' dir='rtl'> <p>	اکنون، با پرسیدن چند سوال درست/غلط، بررسی می کنیم که آیا آموزش‌ها را متوجه شده اید یا خیر. </p> </div>"




};
	

var instructions = {
	type: 'instructions',
	pages: [
		instructions_texts.welcome_page, 
		instructions_texts.second_page,
		instructions_texts.third_page,
		instructions_texts.forth_page,
		instructions_texts.fifth_page,
		instructions_texts.sixth_page,
		instructions_texts.seventh_page,
		instructions_texts.eighth_page,
		instructions_texts.ninth_page,
		instructions_texts.ninth_p_page,
		instructions_texts.tenth_page,
		instructions_texts.eleventh_page,
		instructions_texts.twelve_page
	],
	show_clickable_nav: true,

	data: {},
	on_finish: function(data) {

		jsPsych.data.addDataToLastTrial({
			exp_stage:"instructions",
			exp_part: "instructions"
		})
	}
}